app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("city", "comment", "created_at", "movie_id", "name", "stars", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @review = @movie.reviews.new(review_params)
    if @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 3], ["id", "1"]]
---
  def edit
    @review = @movie.reviews.find(params[:id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "5"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 5]]
---
  def destroy
    @review = @movie.reviews.find(params[:id])
    @review.destroy